OpenPuya/PY32T020_Firmware/Drivers/PY32T020_HAL_Driver/Inc/py32t020_hal_i2c.h
/* Private macros ------------------------------------------------------------*/
/** @defgroup I2C_Private_Macros I2C Private Macros
  * @{
  */

#define I2C_MIN_PCLK_FREQ(__PCLK__, __SPEED__)                  (((__SPEED__) <= 100000U) ? ((__PCLK__) < I2C_MIN_PCLK_FREQ_STANDARD) : \
                                                                 (((__SPEED__) > 100000U) && ((__SPEED__) <= 400000U)) ? ((__PCLK__) < I2C_MIN_PCLK_FREQ_FAST) : \
                                                                 ((__PCLK__) < I2C_MIN_PCLK_FREQ_FAST_PLUS))

#define I2C_CCR_CALCULATION(__PCLK__, __SPEED__, __COEFF__)     (((((__PCLK__) - 1U)/((__SPEED__) * (__COEFF__))) + 1U) & I2C_CCR_CCR)

#define I2C_FREQRANGE(__PCLK__)                                 ((__PCLK__)/1000000U)

#define I2C_RISE_TIME(__FREQRANGE__, __SPEED__)                 (((__SPEED__) <= 100000U) ? ((__FREQRANGE__) + 1U) : \
                                                                 (((__SPEED__) > 100000U) && ((__SPEED__) <= 400000U)) ? ((((__FREQRANGE__) * 300U) / 1000U) + 1U) : \
                                                                 ((((__FREQRANGE__) * 300U) / 2500U) + 1U))

#define I2C_SPEED_STANDARD(__PCLK__, __SPEED__)                 ((I2C_CCR_CALCULATION((__PCLK__), (__SPEED__), 2U) < 4U)? 4U:I2C_CCR_CALCULATION((__PCLK__), (__SPEED__), 2U))

#define I2C_SPEED_FAST(__PCLK__, __SPEED__, __DUTYCYCLE__)      (((__DUTYCYCLE__) == I2C_DUTYCYCLE_2)? I2C_CCR_CALCULATION((__PCLK__), (__SPEED__), 3U) : (I2C_CCR_CALCULATION((__PCLK__), (__SPEED__), 25U) | I2C_DUTYCYCLE_16_9))

#define I2C_SPEED_FAST_PLUS(__PCLK__, __SPEED__, __DUTYCYCLE__) (((__DUTYCYCLE__) == I2C_DUTYCYCLE_2)? I2C_CCR_CALCULATION((__PCLK__), (__SPEED__), 8U) : (I2C_CCR_CALCULATION((__PCLK__), (__SPEED__), 5U) | I2C_DUTYCYCLE_16_9))

#define I2C_SPEED(__PCLK__, __SPEED__, __DUTYCYCLE__)           (((__SPEED__) <= 100000U)? (I2C_SPEED_STANDARD((__PCLK__), (__SPEED__))) : \
                                                                 (((__SPEED__) > 100000U) && ((__SPEED__) <= 400000U)) ? (((I2C_SPEED_FAST((__PCLK__), (__SPEED__), (__DUTYCYCLE__)) & I2C_CCR_CCR) == 0U)? 1U : \
                                                                 ((I2C_SPEED_FAST((__PCLK__), (__SPEED__), (__DUTYCYCLE__))) | I2C_CCR_FS)) : \
                                                                 ((I2C_SPEED_FAST_PLUS((__PCLK__), (__SPEED__), (__DUTYCYCLE__))) | I2C_CCR_FP))

#define I2C_DATA_HOLD_TIME(__FREQRANGE__, __SPEED__)            (((__SPEED__) <= 100000U) ? ((((__FREQRANGE__) * 300U) / 1000U) + 1U) : \
                                                                 (((__SPEED__) > 100000U) && ((__SPEED__) <= 400000U)) ? ((((__FREQRANGE__) * 300U) / 1000U) + 1U) : \
                                                                 ((((__FREQRANGE__) * 300U) / 2500U) + 1U))

#define I2C_7BIT_ADD_WRITE(__ADDRESS__)                         ((uint8_t)((__ADDRESS__) & (uint8_t)(~0x01)))

#define I2C_7BIT_ADD_READ(__ADDRESS__)                          ((uint8_t)((__ADDRESS__) | 0x01))
    
#define I2C_10BIT_ADDRESS(__ADDRESS__)                          ((uint8_t)((uint16_t)((__ADDRESS__) & (uint16_t)0x00FF)))

#define I2C_10BIT_HEADER_WRITE(__ADDRESS__)                     ((uint8_t)((uint16_t)((uint16_t)(((uint16_t)((__ADDRESS__) & (uint16_t)0x0300)) >> 7) | (uint16_t)0x00F0)))

#define I2C_10BIT_HEADER_READ(__ADDRESS__)                      ((uint8_t)((uint16_t)((uint16_t)(((uint16_t)((__ADDRESS__) & (uint16_t)0x0300)) >> 7) | (uint16_t)(0x00F1))))
    
#define I2C_MEM_ADD_MSB(__ADDRESS__)                            ((uint8_t)((uint16_t)(((uint16_t)((__ADDRESS__) & (uint16_t)0xFF00)) >> 8)))

#define I2C_MEM_ADD_LSB(__ADDRESS__)                            ((uint8_t)((uint16_t)((__ADDRESS__) & (uint16_t)0x00FF)))

/** @defgroup I2C_IS_RTC_Definitions I2C Private macros to check input parameters
  * @{
  */

#define IS_I2C_DUTY_CYCLE(CYCLE)                                (((CYCLE) == I2C_DUTYCYCLE_2) || \
                                                                 ((CYCLE) == I2C_DUTYCYCLE_16_9))

#define IS_I2C_DATA_TIME_HOLD_SEL(SEL)                          (((SEL) == I2C_DATA_HOLD_TIME_HARDWARE) || \
                                                                 ((SEL) == I2C_DATA_HOLD_TIME_SOFTWARE))

#define IS_I2C_ADDRESSING_MODE(ADDRESS)                         (((ADDRESS) == I2C_ADDRESSINGMODE_7BIT) || \
                                                                 ((ADDRESS) == I2C_ADDRESSINGMODE_10BIT))

#define IS_I2C_DUAL_ADDRESS(ADDRESS)                            (((ADDRESS) == I2C_DUALADDRESS_DISABLE) || \
                                                                 ((ADDRESS) == I2C_DUALADDRESS_ENABLE))

#define IS_I2C_GENERAL_CALL(CALL)                               (((CALL) == I2C_GENERALCALL_DISABLE) || \
                                                                 ((CALL) == I2C_GENERALCALL_ENABLE))

#define IS_I2C_NO_STRETCH(STRETCH)                              (((STRETCH) == I2C_NOSTRETCH_DISABLE) || \
                                                                 ((STRETCH) == I2C_NOSTRETCH_ENABLE))

#define IS_I2C_MEMADD_SIZE(SIZE)                                (((SIZE) == I2C_MEMADD_SIZE_8BIT) || \
                                                                 ((SIZE) == I2C_MEMADD_SIZE_16BIT))

#define IS_I2C_CLOCK_SPEED(SPEED)                               (((SPEED) > 0U) && ((SPEED) <= 1000000U))

#define IS_I2C_OWN_ADDRESS1(ADDRESS1)                           (((ADDRESS1) & 0xFFFFFC00U) == 0U)

#define IS_I2C_OWN_ADDRESS2(ADDRESS2)                           (((ADDRESS2) & 0xFFFFFF01U) == 0U)

#define IS_I2C_TRANSFER_OPTIONS_REQUEST(REQUEST)                (((REQUEST) == I2C_FIRST_FRAME)              || \
                                                                 ((REQUEST) == I2C_FIRST_AND_NEXT_FRAME)     || \
                                                                 ((REQUEST) == I2C_NEXT_FRAME)               || \
                                                                 ((REQUEST) == I2C_FIRST_AND_LAST_FRAME)     || \
                                                                 ((REQUEST) == I2C_LAST_FRAME)               || \
                                                                 ((REQUEST) == I2C_LAST_FRAME_NO_STOP)       || \
                                                                 IS_I2C_TRANSFER_OTHER_OPTIONS_REQUEST(REQUEST))

#define IS_I2C_TRANSFER_OTHER_OPTIONS_REQUEST(REQUEST)          (((REQUEST) == I2C_OTHER_FRAME)     || \
                                                                 ((REQUEST) == I2C_OTHER_AND_LAST_FRAME))

#define IS_I2C_WAKEUP_TIMEOUT_CLK_DIV(__DIV__)                  (((__DIV__) == I2C_WAKEUP_TIMEOUT_CLK_DIV_128) || \
                                                                 ((__DIV__) == I2C_WAKEUP_TIMEOUT_CLK_DIV_256) || \
                                                                 ((__DIV__) == I2C_WAKEUP_TIMEOUT_CLK_DIV_512) || \
                                                                 ((__DIV__) == I2C_WAKEUP_TIMEOUT_CLK_DIV_1024))   

#define IS_I2C_WAKEUP_TIMEOUT_CNT(__CNT__)                      (((__CNT__) == I2C_WAKEUP_TIMEOUT_CNT_2)  || \
                                                                 ((__CNT__) == I2C_WAKEUP_TIMEOUT_CNT_8)  || \
                                                                 ((__CNT__) == I2C_WAKEUP_TIMEOUT_CNT_32) || \
                                                                 ((__CNT__) == I2C_WAKEUP_TIMEOUT_CNT_128))   

#define I2C_CHECK_FLAG(__ISR__, __FLAG__)                       ((((__ISR__) & ((__FLAG__) & I2C_FLAG_MASK)) == ((__FLAG__) & I2C_FLAG_MASK)) ? SET : RESET)
#define I2C_CHECK_IT_SOURCE(__CR1__, __IT__)                    ((((__CR1__) & (__IT__)) == (__IT__)) ? SET : RESET)
/**
  * @}
  */

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/** @defgroup I2C_Private_Functions I2C Private Functions
  * @{
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif


#endif /* __PY32T020_HAL_I2C_H */

/************************ (C) COPYRIGHT Puya *****END OF FILE******************/
